Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="ADC Digital Filter Register" name="ADCFLTR4" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR4__CHNLID" />
            <bitfield caption="Digital Filter 'x' Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR4__AFRDY" />
            <bitfield caption="Digital Filter 'x' Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR4__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR4__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR4__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR4__DATA16EN" />
            <bitfield caption="Digital Filter 'x' Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR4__AFEN" />
         </register>
         <register caption="ADC Trigger Source 1 Register" name="ADCTRG1" offset="0x200" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of ADC0 Module Select bits" mask="0x0000001F" name="TRGSRC0" values="ADCTRG1__TRGSRC0" />
            <bitfield caption="Trigger Source for Conversion of ADC1 Module Select bits" mask="0x00001F00" name="TRGSRC1" values="ADCTRG1__TRGSRC1" />
            <bitfield caption="Trigger Source for Conversion of ADC2 Module Select bits" mask="0x001F0000" name="TRGSRC2" values="ADCTRG1__TRGSRC2" />
            <bitfield caption="Trigger Source for Conversion of ADC3 Module Select bits" mask="0x1F000000" name="TRGSRC3" values="ADCTRG1__TRGSRC3" />
         </register>
         <register caption="ADC Trigger Source 2 Register" name="ADCTRG2" offset="0x210" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of ADC4 Module Select bits" mask="0x0000001F" name="TRGSRC4" values="ADCTRG2__TRGSRC4" />
            <bitfield caption="Trigger Source for Conversion of ADC5 Module Select bits" mask="0x00001F00" name="TRGSRC5" values="ADCTRG2__TRGSRC5" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN6 Select bits" mask="0x001F0000" name="TRGSRC6" values="ADCTRG2__TRGSRC6" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN7 Select bits" mask="0x1F000000" name="TRGSRC7" values="ADCTRG2__TRGSRC7" />
         </register>
         <register caption="ADC Trigger Source 3 Register" name="ADCTRG3" offset="0x220" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN8 Select bits" mask="0x0000001F" name="TRGSRC8" values="ADCTRG3__TRGSRC8" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN9 Select bits" mask="0x00001F00" name="TRGSRC9" values="ADCTRG3__TRGSRC9" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN10 Select bits" mask="0x001F0000" name="TRGSRC10" values="ADCTRG3__TRGSRC10" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN11 Select bits" mask="0x1F000000" name="TRGSRC11" values="ADCTRG3__TRGSRC11" />
         </register>
         <register caption="ADC Trigger Source 4 Register" name="ADCTRG4" offset="0x230" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN12 Select bits" mask="0x0000001F" name="TRGSRC12" values="ADCTRG4__TRGSRC12" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN13 Select bits" mask="0x00001F00" name="TRGSRC13" values="ADCTRG4__TRGSRC13" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN14 Select bits" mask="0x001F0000" name="TRGSRC14" values="ADCTRG4__TRGSRC14" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN15 Select bits" mask="0x1F000000" name="TRGSRC15" values="ADCTRG4__TRGSRC15" />
         </register>
         <register caption="ADC Trigger Source 5 Register" name="ADCTRG5" offset="0x240" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN16 Select bits" mask="0x0000001F" name="TRGSRC16" values="ADCTRG5__TRGSRC16" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN17 Select bits" mask="0x00001F00" name="TRGSRC17" values="ADCTRG5__TRGSRC17" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN18 Select bits" mask="0x001F0000" name="TRGSRC18" values="ADCTRG5__TRGSRC18" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN19 Select bits" mask="0x1F000000" name="TRGSRC19" values="ADCTRG5__TRGSRC19" />
         </register>
         <register caption="ADC Trigger Source 6 Register" name="ADCTRG6" offset="0x250" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN20 Select bits" mask="0x0000001F" name="TRGSRC20" values="ADCTRG6__TRGSRC20" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN21 Select bits" mask="0x00001F00" name="TRGSRC21" values="ADCTRG6__TRGSRC21" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN22 Select bits" mask="0x001F0000" name="TRGSRC22" values="ADCTRG6__TRGSRC22" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN23 Select bits" mask="0x1F000000" name="TRGSRC23" values="ADCTRG6__TRGSRC23" />
         </register>
         <register caption="ADC Trigger Source 7 Register" name="ADCTRG7" offset="0x260" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN24 Select bits" mask="0x0000001F" name="TRGSRC24" values="ADCTRG7__TRGSRC24" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN25 Select bits" mask="0x00001F00" name="TRGSRC25" values="ADCTRG7__TRGSRC25" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN26 Select bits" mask="0x001F0000" name="TRGSRC26" values="ADCTRG7__TRGSRC26" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN27 Select bits" mask="0x1F000000" name="TRGSRC27" values="ADCTRG7__TRGSRC27" />
         </register>
         <register caption="ADC Digital Comparator 1 Control Register" name="ADCCMPCON1" offset="0x280" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator 0 Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON1__IELOLO" />
            <bitfield caption="Low/High Digital Comparator 0 Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON1__IELOHI" />
            <bitfield caption="High/Low Digital Comparator 0 Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON1__IEHILO" />
            <bitfield caption="High/High Digital Comparator 0 Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON1__IEHIHI" />
            <bitfield caption="Between Low/High Digital Comparator 1 Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON1__IEBTWN" />
            <bitfield caption="Digital Comparator 1 Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON1__DCMPED" />
            <bitfield caption="Digital Comparator 1 Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON1__DCMPGIEN" />
            <bitfield caption="Digital Comparator 1 Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON1__ENDCMP" />
            <bitfield caption="Digital Comparator 1 Analog Input Identification bits" mask="0x00003F00" name="AINID" values="ADCCMPCON1__AINID" />
            <bitfield mask="0xFFFF0000" name="CVDDATA" />
         </register>
         <register caption="ADC Digital Comparator 'x' Control Register" name="ADCCMPCON2" offset="0x290" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON2__IELOLO" />
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON2__IELOHI" />
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON2__IEHILO" />
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON2__IEHIHI" />
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON2__IEBTWN" />
            <bitfield caption="Digital Comparator 'x' Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON2__DCMPED" />
            <bitfield caption="Digital Comparator 'x' Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON2__DCMPGIEN" />
            <bitfield caption="Digital Comparator 'x' Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON2__ENDCMP" />
            <bitfield caption="Digital Comparator 'x' Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON2__AINID" />
         </register>
         <register caption="ADC Digital Comparator 'x' Control Register" name="ADCCMPCON3" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON3__IELOLO" />
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON3__IELOHI" />
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON3__IEHILO" />
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON3__IEHIHI" />
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON3__IEBTWN" />
            <bitfield caption="Digital Comparator 'x' Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON3__DCMPED" />
            <bitfield caption="Digital Comparator 'x' Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON3__DCMPGIEN" />
            <bitfield caption="Digital Comparator 'x' Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON3__ENDCMP" />
            <bitfield caption="Digital Comparator 'x' Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON3__AINID" />
         </register>
         <register caption="ADC Digital Comparator 'x' Control Register" name="ADCCMPCON4" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON4__IELOLO" />
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON4__IELOHI" />
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON4__IEHILO" />
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON4__IEHIHI" />
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON4__IEBTWN" />
            <bitfield caption="Digital Comparator 'x' Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON4__DCMPED" />
            <bitfield caption="Digital Comparator 'x' Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON4__DCMPGIEN" />
            <bitfield caption="Digital Comparator 'x' Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON4__ENDCMP" />
            <bitfield caption="Digital Comparator 'x' Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON4__AINID" />
         </register>
