Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA11" offset="0x6b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA12" offset="0x6c0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA13" offset="0x6d0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA14" offset="0x6e0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA15" offset="0x6f0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA16" offset="0x700" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA17" offset="0x710" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA18" offset="0x720" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA19" offset="0x730" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA20" offset="0x740" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA21" offset="0x750" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA22" offset="0x760" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA23" offset="0x770" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA24" offset="0x780" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA25" offset="0x790" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA26" offset="0x7a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA27" offset="0x7b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA33" offset="0x810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA34" offset="0x820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA35" offset="0x830" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA36" offset="0x840" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA37" offset="0x850" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA38" offset="0x860" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA39" offset="0x870" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA40" offset="0x880" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA41" offset="0x890" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA45" offset="0x8d0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA46" offset="0x8e0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA47" offset="0x8f0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA48" offset="0x900" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA49" offset="0x910" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA50" offset="0x920" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
