Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY9">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY10">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY11">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY12">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY13">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY14">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY15">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY16">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY17">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY18">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY19">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY20">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY21">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY22">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY23">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY24">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY25">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY26">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY27">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY33">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY34">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
