Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="Transmit Event FIFO Status Register" name="CFD1TEFSTA" offset="0x110" rw="RW" size="4">
            <bitfield caption="Transmit Event FIFO Not Empty Interrupt Flag bit" mask="0x00000001" name="TEFNEIF" values="CFD1TEFSTA__TEFNEIF" />
            <bitfield caption="Transmit Event FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="TEFHIF" values="CFD1TEFSTA__TEFHIF" />
            <bitfield caption="Transmit Event FIFO Full Interrupt Flag bit" mask="0x00000004" name="TEFFIF" values="CFD1TEFSTA__TEFFIF" />
            <bitfield caption="Transmit Event FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="TEFOVIF" values="CFD1TEFSTA__TEFOVIF" />
         </register>
         <register caption="Transmit Event FIFO User Address Register" name="CFD1TEFUA" offset="0x120" rw="RW" size="4">
            <bitfield caption="Transmit Event FIFO User Address bits" mask="0xFFFFFFFF" name="TEFUA" />
         </register>
         <register caption="Message Memory Base Address Register" name="CFD1FIFOBA" offset="0x130" rw="RW" size="4">
            <bitfield caption="Message Memory Base Address bits" mask="0xFFFFFFFF" name="FIFOBA" />
         </register>
         <register caption="Transmit Queue Control Register" name="CFD1TXQCON" offset="0x140" rw="RW" size="4">
            <bitfield caption="Transmit Queue Not Full Interrupt Enable bit" mask="0x00000001" name="TXQNIE" values="CFD1TXQCON__TXQNIE" />
            <bitfield caption="Transmit Queue Empty Interrupt Enable bit" mask="0x00000004" name="TXQEIE" values="CFD1TXQCON__TXQEIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1TXQCON__TXATIE" />
            <bitfield caption="TX Enable" mask="0x00000080" name="TXEN" values="CFD1TXQCON__TXEN" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00000100" name="UINC" values="CFD1TXQCON__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1TXQCON__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1TXQCON__FRESET" />
            <bitfield caption="Message Transmit Priority bits" mask="0x001F0000" name="TXPRI" values="CFD1TXQCON__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1TXQCON__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1TXQCON__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1TXQCON__PLSIZE" />
         </register>
         <register caption="Transmit Queue Status Register" name="CFD1TXQSTA" offset="0x150" rw="RW" size="4">
            <bitfield caption="Transmit Queue Not Full Interrupt Flag bit" mask="0x00000001" name="TXQNIF" values="CFD1TXQSTA__TXQNIF" />
            <bitfield caption="Transmit Queue Empty Interrupt Flag bit" mask="0x00000004" name="TXQEIF" values="CFD1TXQSTA__TXQEIF" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Pending bit" mask="0x00000010" name="TXATIF" values="CFD1TXQSTA__TXATIF" />
            <bitfield caption="Error Detected During Transmission bit" mask="0x00000020" name="TXERR" values="CFD1TXQSTA__TXERR" />
            <bitfield caption="Message Lost Arbitration Status bit" mask="0x00000040" name="TXLARB" values="CFD1TXQSTA__TXLARB" />
            <bitfield caption="Message Aborted Status bit" mask="0x00000080" name="TXABT" values="CFD1TXQSTA__TXABT" />
            <bitfield caption="Transmit Queue Message Index bits" mask="0x00001F00" name="TXQCI" />
         </register>
         <register caption="Transmit Queue User Address Register" name="CFD1TXQUA" offset="0x160" rw="RW" size="4">
            <bitfield caption="Transmit Queue User Address bits" mask="0xFFFFFFFF" name="TXQUA" />
         </register>
         <register caption="FIFO Control Registe" name="CFD1FIFOCON1" offset="0x170" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON1__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON1__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON1__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON1__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON1__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON1__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON1__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON1__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON1__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON1__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON1__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON1__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON1__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON1__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON1__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA1" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA1" offset="0x190" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON2" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON2__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON2__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON2__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON2__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON2__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON2__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON2__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON2__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON2__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON2__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON2__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON2__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON2__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON2__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON2__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA2" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA2" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
