Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="FIFO Control Register" name="CFD1FIFOCON3" offset="0x1d0" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON3__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON3__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON3__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON3__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON3__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON3__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON3__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON3__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON3__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON3__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON3__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON3__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON3__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON3__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON3__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA3" offset="0x1e0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA3" offset="0x1f0" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON4" offset="0x200" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON4__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON4__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON4__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON4__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON4__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON4__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON4__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON4__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON4__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON4__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON4__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON4__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON4__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON4__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON4__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA4" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA4" offset="0x220" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON5" offset="0x230" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON5__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON5__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON5__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON5__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON5__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON5__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON5__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON5__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON5__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON5__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON5__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON5__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON5__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON5__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON5__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA5" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA5" offset="0x250" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON6" offset="0x260" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON6__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON6__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON6__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON6__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON6__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON6__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON6__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON6__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON6__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON6__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON6__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON6__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON6__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON6__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON6__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA6" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA6" offset="0x280" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
