Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
      <value-group caption="Transmitter Delay Compensation Offset bits" name="CFD1TDC__TDCO">
         <value caption="63 x SYSCLK" name="" value="0x3f" />
         <value caption="62 x SYSCLK" name="" value="0x3e" />
         <value caption="61 x SYSCLK" name="" value="0x3d" />
         <value caption="60 x SYSCLK" name="" value="0x3c" />
         <value caption="59 x SYSCLK" name="" value="0x3b" />
         <value caption="58 x SYSCLK" name="" value="0x3a" />
         <value caption="57 x SYSCLK" name="" value="0x39" />
         <value caption="56 x SYSCLK" name="" value="0x38" />
         <value caption="55 x SYSCLK" name="" value="0x37" />
         <value caption="54 x SYSCLK" name="" value="0x36" />
         <value caption="53 x SYSCLK" name="" value="0x35" />
         <value caption="52 x SYSCLK" name="" value="0x34" />
         <value caption="51 x SYSCLK" name="" value="0x33" />
         <value caption="50 x SYSCLK" name="" value="0x32" />
         <value caption="49 x SYSCLK" name="" value="0x31" />
         <value caption="48 x SYSCLK" name="" value="0x30" />
         <value caption="47 x SYSCLK" name="" value="0x2f" />
         <value caption="46 x SYSCLK" name="" value="0x2e" />
         <value caption="45 x SYSCLK" name="" value="0x2d" />
         <value caption="44 x SYSCLK" name="" value="0x2c" />
         <value caption="43 x SYSCLK" name="" value="0x2b" />
         <value caption="42 x SYSCLK" name="" value="0x2a" />
         <value caption="41 x SYSCLK" name="" value="0x29" />
         <value caption="40 x SYSCLK" name="" value="0x28" />
         <value caption="39 x SYSCLK" name="" value="0x27" />
         <value caption="38 x SYSCLK" name="" value="0x26" />
         <value caption="37 x SYSCLK" name="" value="0x25" />
         <value caption="36 x SYSCLK" name="" value="0x24" />
         <value caption="35 x SYSCLK" name="" value="0x23" />
         <value caption="34 x SYSCLK" name="" value="0x22" />
         <value caption="33 x SYSCLK" name="" value="0x21" />
         <value caption="32 x SYSCLK" name="" value="0x20" />
         <value caption="31 x SYSCLK" name="" value="0x1f" />
         <value caption="30 x SYSCLK" name="" value="0x1e" />
         <value caption="29 x SYSCLK" name="" value="0x1d" />
         <value caption="28 x SYSCLK" name="" value="0x1c" />
         <value caption="27 x SYSCLK" name="" value="0x1b" />
         <value caption="26 x SYSCLK" name="" value="0x1a" />
         <value caption="25 x SYSCLK" name="" value="0x19" />
         <value caption="24 x SYSCLK" name="" value="0x18" />
         <value caption="23 x SYSCLK" name="" value="0x17" />
         <value caption="22 x SYSCLK" name="" value="0x16" />
         <value caption="21 x SYSCLK" name="" value="0x15" />
         <value caption="20 x SYSCLK" name="" value="0x14" />
         <value caption="19 x SYSCLK" name="" value="0x13" />
         <value caption="18 x SYSCLK" name="" value="0x12" />
         <value caption="17 x SYSCLK" name="" value="0x11" />
         <value caption="16 x SYSCLK" name="" value="0x10" />
         <value caption="15 x SYSCLK" name="" value="0xf" />
         <value caption="14 x SYSCLK" name="" value="0xe" />
         <value caption="13 x SYSCLK" name="" value="0xd" />
         <value caption="12 x SYSCLK" name="" value="0xc" />
         <value caption="11 x SYSCLK" name="" value="0xb" />
         <value caption="10 x SYSCLK" name="" value="0xa" />
         <value caption="9 x SYSCLK" name="" value="0x9" />
         <value caption="8 x SYSCLK" name="" value="0x8" />
         <value caption="7 x SYSCLK" name="" value="0x7" />
         <value caption="6 x SYSCLK" name="" value="0x6" />
         <value caption="5 x SYSCLK" name="" value="0x5" />
         <value caption="4 x SYSCLK" name="" value="0x4" />
         <value caption="3 x SYSCLK" name="" value="0x3" />
         <value caption="2 x SYSCLK" name="" value="0x2" />
         <value caption="1 x SYSCLK" name="" value="0x1" />
         <value caption="0 x SYSCLK" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmitter Delay Compensation Mode bits" name="CFD1TDC__TDCMOD">
         <value caption="Auto; measure delay and add CFDxDBTCFG.TSEG1; add TDCO" name="" value="0x2" />
         <value caption="Manual; Do not measure use TDCV plus TDCO from the register" name="" value="0x1" />
         <value caption="Disable" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable 12-Bit SID in CAN FD Base Format Messages bit" name="CFD1TDC__SID11EN">
         <value caption="RRS is used as SID11 in CAN FD base format messages: SID(11-0) = {SID(10-0)" name="" value="0x1" />
         <value caption="Do not use RRS; SID(10-0) according to ISO11898-1 2015" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Edge Filtering during Bus Integration state bit" name="CFD1TDC__EDGFLTEN">
         <value caption="Edge Filtering enabled" name="" value="0x1" />
         <value caption="Edge Filtering disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Time Base Counter Prescaler bits" name="CFD1TSCON__TBCPRE">
         <value caption="TBC increments every 1024 SYSCLK clock cycles" name="" value="0x1ff" />
         <value caption="TBC increments every 1 SYSCLK clock cycle" name="" value="0x0" />
      </value-group>
      <value-group caption="Time Base Counter Enable bit" name="CFD1TSCON__TBCEN">
         <value caption="Enable TBC" name="" value="0x1" />
         <value caption="Stop and reset TBC" name="" value="0x0" />
      </value-group>
      <value-group caption="Time Stamp EOF bit" name="CFD1TSCON__TSEOF">
         <value caption="Time Stamp when frame is taken valid (11898-1 10.7)" name="" value="0x1" />
         <value caption="Time Stamp at beginning of Frame (classical frame) at sample point of SOF / FD frame: see the TSRES bit" name="" value="0x0" />
      </value-group>
      <value-group caption="Time Stamp Resolution bit" name="CFD1TSCON__TSRES">
         <value caption="At sample point of the bit following the FDF bit" name="" value="0x1" />
         <value caption="At sample point of SOF" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Flag Code bits" name="CFD1VEC__ICODE">
         <value caption="Transmit attempt interrupt (any bit in the CFDxTXATIF register is set)" name="" value="0x4a" />
         <value caption="Transmit event FIFO interrupt (any bit in the CFDxTEFIF register is set)" name="" value="0x49" />
         <value caption="Invalid message occurred (IVMIF/IE)" name="" value="0x48" />
         <value caption="CAN module mode change Occurred (MODIF/IE)" name="" value="0x47" />
         <value caption="CAN Timer Overflow (CTMRIF/IE)" name="" value="0x46" />
         <value caption="RX/TX MAB overflow/underflow (RX: message received before previous message was saved to memory; TX: cannot feed TX MAB fast enough to transmit consistent data.) (SERRIF/IE)" name="" value="0x45" />
         <value caption="Address error interrupt (illegal FIFO address presented to system) (SERRIF/IE)" name="" value="0x44" />
         <value caption="Receive FIFO overflow interrupt (any bit in CFDxRXOVIF set)" name="" value="0x43" />
         <value caption="Wake-up interrupt (WAKIF/WAKIE)" name="" value="0x42" />
         <value caption="Error interrupt (CERRIF/IE)" name="" value="0x41" />
         <value caption="No interrupt" name="" value="0x40" />
         <value caption="FIFO 31 interrupt (TFIF31 or RFIF31 set)" name="" value="0x1f" />
         <value caption="FIFO 30 interrupt (TFIF30 or RFIF30 set)" name="" value="0x1e" />
         <value caption="FIFO 29 interrupt (TFIF29 or RFIF29 set)" name="" value="0x1d" />
         <value caption="FIFO 28 interrupt (TFIF28 or RFIF28 set)" name="" value="0x1c" />
         <value caption="FIFO 27 interrupt (TFIF27 or RFIF27 set)" name="" value="0x1b" />
         <value caption="FIFO 26 interrupt (TFIF26 or RFIF26 set)" name="" value="0x1a" />
         <value caption="FIFO 25 interrupt (TFIF25 or RFIF25 set)" name="" value="0x19" />
         <value caption="FIFO 24 interrupt (TFIF24 or RFIF24 set)" name="" value="0x18" />
         <value caption="FIFO 23 interrupt (TFIF23 or RFIF23 set)" name="" value="0x17" />
         <value caption="FIFO 22 interrupt (TFIF22 or RFIF22 set)" name="" value="0x16" />
         <value caption="FIFO 21 interrupt (TFIF21 or RFIF21 set)" name="" value="0x15" />
         <value caption="FIFO 20 interrupt (TFIF20 or RFIF20 set)" name="" value="0x14" />
         <value caption="FIFO 19 interrupt (TFIF19 or RFIF19 set)" name="" value="0x13" />
         <value caption="FIFO 18 interrupt (TFIF18 or RFIF18 set)" name="" value="0x12" />
         <value caption="FIFO 17 interrupt (TFIF17 or RFIF17 set)" name="" value="0x11" />
         <value caption="FIFO 16 interrupt (TFIF16 or RFIF16 set)" name="" value="0x10" />
         <value caption="FIFO 15 interrupt (TFIF15 or RFIF15 set)" name="" value="0xf" />
         <value caption="FIFO 14 interrupt (TFIF14 or RFIF14 set)" name="" value="0xe" />
         <value caption="FIFO 13 interrupt (TFIF13 or RFIF13 set)" name="" value="0xd" />
         <value caption="FIFO 12 interrupt (TFIF12 or RFIF12 set)" name="" value="0xc" />
         <value caption="FIFO 11 interrupt (TFIF11 or RFIF11 set)" name="" value="0xb" />
         <value caption="FIFO 10 interrupt (TFIF10 or RFIF10 set)" name="" value="0xa" />
         <value caption="FIFO 9 interrupt (TFIF9 or RFIF9 set)" name="" value="0x9" />
         <value caption="FIFO 8 interrupt (TFIF8 or RFIF8 set)" name="" value="0x8" />
         <value caption="FIFO 7 interrupt (TFIF7 or RFIF7 set)" name="" value="0x7" />
         <value caption="FIFO 6 interrupt (TFIF6 or RFIF6 set)" name="" value="0x6" />
         <value caption="FIFO 5 interrupt (TFIF5 or RFIF5 set)" name="" value="0x5" />
         <value caption="FIFO 4 interrupt (TFIF4 or RFIF4 set)" name="" value="0x4" />
         <value caption="FIFO 3 interrupt (TFIF3 or RFIF3 set)" name="" value="0x3" />
         <value caption="FIFO 2 interrupt (TFIF2 or RFIF2 set)" name="" value="0x2" />
         <value caption="FIFO 1 interrupt (TFIF1 or RFIF1 set)" name="" value="0x1" />
         <value caption="FIFO 0 interrupt (TFIF0 set)" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter Hit Number bits" name="CFD1VEC__FILHIT">
         <value caption="Filter 31" name="" value="0x1f" />
         <value caption="Filter 30" name="" value="0x1e" />
         <value caption="Filter 29" name="" value="0x1d" />
         <value caption="Filter 28" name="" value="0x1c" />
         <value caption="Filter 27" name="" value="0x1b" />
         <value caption="Filter 26" name="" value="0x1a" />
         <value caption="Filter 25" name="" value="0x19" />
         <value caption="Filter 24" name="" value="0x18" />
         <value caption="Filter 23" name="" value="0x17" />
         <value caption="Filter 22" name="" value="0x16" />
         <value caption="Filter 21" name="" value="0x15" />
         <value caption="Filter 20" name="" value="0x14" />
         <value caption="Filter 19" name="" value="0x13" />
         <value caption="Filter 18" name="" value="0x12" />
         <value caption="Filter 17" name="" value="0x11" />
         <value caption="Filter 16" name="" value="0x10" />
         <value caption="Filter 15" name="" value="0xf" />
         <value caption="Filter 14" name="" value="0xe" />
         <value caption="Filter 13" name="" value="0xd" />
         <value caption="Filter 12" name="" value="0xc" />
         <value caption="Filter 11" name="" value="0xb" />
         <value caption="Filter 10" name="" value="0xa" />
         <value caption="Filter 9" name="" value="0x9" />
         <value caption="Filter 8" name="" value="0x8" />
         <value caption="Filter 7" name="" value="0x7" />
         <value caption="Filter 6" name="" value="0x6" />
         <value caption="Filter 5" name="" value="0x5" />
         <value caption="Filter 4" name="" value="0x4" />
         <value caption="Filter 3" name="" value="0x3" />
         <value caption="Filter 2" name="" value="0x2" />
         <value caption="Filter 1" name="" value="0x1" />
         <value caption="Filter 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Interrupt Flag Code bits" name="CFD1VEC__TXCODE">
         <value caption="No interrupt" name="" value="0x40" />
         <value caption="FIFO 31 Interrupt" name="" value="0x1f" />
         <value caption="FIFO 30 Interrupt" name="" value="0x1e" />
         <value caption="FIFO 29 Interrupt" name="" value="0x1d" />
         <value caption="FIFO 28 Interrupt" name="" value="0x1c" />
         <value caption="FIFO 27 Interrupt" name="" value="0x1b" />
         <value caption="FIFO 26 Interrupt" name="" value="0x1a" />
         <value caption="FIFO 25 Interrupt" name="" value="0x19" />
         <value caption="FIFO 24 Interrupt" name="" value="0x18" />
         <value caption="FIFO 23 Interrupt" name="" value="0x17" />
         <value caption="FIFO 22 Interrupt" name="" value="0x16" />
         <value caption="FIFO 21 Interrupt" name="" value="0x15" />
         <value caption="FIFO 20 Interrupt" name="" value="0x14" />
         <value caption="FIFO 19 Interrupt" name="" value="0x13" />
         <value caption="FIFO 18 Interrupt" name="" value="0x12" />
         <value caption="FIFO 17 Interrupt" name="" value="0x11" />
         <value caption="FIFO 16 Interrupt" name="" value="0x10" />
         <value caption="FIFO 15 Interrupt" name="" value="0xf" />
         <value caption="FIFO 14 Interrupt" name="" value="0xe" />
         <value caption="FIFO 13 Interrupt" name="" value="0xd" />
         <value caption="FIFO 12 Interrupt" name="" value="0xc" />
         <value caption="FIFO 11 Interrupt" name="" value="0xb" />
         <value caption="FIFO 10 Interrupt" name="" value="0xa" />
         <value caption="FIFO 9 Interrupt" name="" value="0x9" />
         <value caption="FIFO 8 Interrupt" name="" value="0x8" />
         <value caption="FIFO 7 Interrupt" name="" value="0x7" />
         <value caption="FIFO 6 Interrupt" name="" value="0x6" />
         <value caption="FIFO 5 Interrupt" name="" value="0x5" />
         <value caption="FIFO 4 Interrupt" name="" value="0x4" />
         <value caption="FIFO 3 Interrupt" name="" value="0x3" />
         <value caption="FIFO 2 Interrupt" name="" value="0x2" />
         <value caption="FIFO 1 Interrupt" name="" value="0x1" />
         <value caption="FIFO 0 Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Interrupt Flag Code bits" name="CFD1VEC__RXCODE">
         <value caption="No interrupt" name="" value="0x40" />
         <value caption="FIFO 31 Interrupt" name="" value="0x1f" />
         <value caption="FIFO 30 Interrupt" name="" value="0x1e" />
         <value caption="FIFO 29 Interrupt" name="" value="0x1d" />
         <value caption="FIFO 28 Interrupt" name="" value="0x1c" />
         <value caption="FIFO 27 Interrupt" name="" value="0x1b" />
         <value caption="FIFO 26 Interrupt" name="" value="0x1a" />
         <value caption="FIFO 25 Interrupt" name="" value="0x19" />
         <value caption="FIFO 24 Interrupt" name="" value="0x18" />
         <value caption="FIFO 23 Interrupt" name="" value="0x17" />
         <value caption="FIFO 22 Interrupt" name="" value="0x16" />
         <value caption="FIFO 21 Interrupt" name="" value="0x15" />
         <value caption="FIFO 20 Interrupt" name="" value="0x14" />
         <value caption="FIFO 19 Interrupt" name="" value="0x13" />
         <value caption="FIFO 18 Interrupt" name="" value="0x12" />
         <value caption="FIFO 17 Interrupt" name="" value="0x11" />
         <value caption="FIFO 16 Interrupt" name="" value="0x10" />
         <value caption="FIFO 15 Interrupt" name="" value="0xf" />
         <value caption="FIFO 14 Interrupt" name="" value="0xe" />
         <value caption="FIFO 13 Interrupt" name="" value="0xd" />
         <value caption="FIFO 12 Interrupt" name="" value="0xc" />
         <value caption="FIFO 11 Interrupt" name="" value="0xb" />
         <value caption="FIFO 10 Interrupt" name="" value="0xa" />
         <value caption="FIFO 9 Interrupt" name="" value="0x9" />
         <value caption="FIFO 8 Interrupt" name="" value="0x8" />
         <value caption="FIFO 7 Interrupt" name="" value="0x7" />
         <value caption="FIFO 6 Interrupt" name="" value="0x6" />
         <value caption="FIFO 5 Interrupt" name="" value="0x5" />
         <value caption="FIFO 4 Interrupt" name="" value="0x4" />
         <value caption="FIFO 3 Interrupt" name="" value="0x3" />
         <value caption="FIFO 2 Interrupt" name="" value="0x2" />
         <value caption="FIFO 1 Interrupt" name="" value="0x1" />
         <value caption="Reserved. FIFO 0 cant receive." name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Object Interrupt Flag bit" name="CFD1INT__TXIF">
         <value caption="Transmit object interrupt pending" name="" value="0x1" />
         <value caption="No transmit object interrupts pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Object Interrupt Flag bit" name="CFD1INT__RXIF">
         <value caption="Receive object interrupt pending" name="" value="0x1" />
         <value caption="No receive object interrupts pending" name="" value="0x0" />
      </value-group>
