Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ11__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK11__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK11__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ12__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ12__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK12__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK12__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ13__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ13__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK13__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK13__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ14__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ14__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK14__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK14__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ15__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ15__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK15__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK15__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
