Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="" name="f12" offset="0x1dc" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f12" />
         </register>
         <register caption="" name="f13" offset="0x1e0" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f13" />
         </register>
         <register caption="" name="f14" offset="0x1e4" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f14" />
         </register>
         <register caption="" name="f15" offset="0x1e8" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f15" />
         </register>
         <register caption="" name="f16" offset="0x1ec" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f16" />
         </register>
         <register caption="" name="f17" offset="0x1f0" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f17" />
         </register>
         <register caption="" name="f18" offset="0x1f4" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f18" />
         </register>
         <register caption="" name="f19" offset="0x1f8" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f19" />
         </register>
         <register caption="" name="f20" offset="0x1fc" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f20" />
         </register>
         <register caption="" name="f21" offset="0x200" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f21" />
         </register>
         <register caption="" name="f22" offset="0x204" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f22" />
         </register>
         <register caption="" name="f23" offset="0x208" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f23" />
         </register>
         <register caption="" name="f24" offset="0x20c" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f24" />
         </register>
         <register caption="" name="f25" offset="0x210" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f25" />
         </register>
         <register caption="" name="f26" offset="0x214" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f26" />
         </register>
         <register caption="" name="f27" offset="0x218" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f27" />
         </register>
         <register caption="" name="f28" offset="0x21c" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f28" />
         </register>
         <register caption="" name="f29" offset="0x220" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f29" />
         </register>
         <register caption="" name="f30" offset="0x224" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f30" />
         </register>
         <register caption="" name="f31" offset="0x228" rw="RW" size="8">
            <bitfield mask="0xFFFFFFFFFFFFFFFF" name="f31" />
         </register>
         <register caption="Floating Point Implementation Register; CP1 Register 0" name="FIR" offset="0x22c" rw="R" size="4">
            <bitfield mask="0x000000FF" name="Revision" />
            <bitfield mask="0x0000FF00" name="ProcessorID" />
            <bitfield caption="Single-precision Floating Point Data bit" mask="0x00010000" name="S" values="FIR__S" />
            <bitfield caption="Double-precision Floating Point Data bit" mask="0x00020000" name="D" values="FIR__D" />
            <bitfield caption="Paired Single Floating Point data bit" mask="0x00040000" name="PS" values="FIR__PS" />
            <bitfield mask="0x00080000" name="MIPS_3D" />
            <bitfield caption="Word Fixed Point data type bit" mask="0x00100000" name="W" values="FIR__W" />
            <bitfield caption="Long Fixed Point Data Type bit" mask="0x00200000" name="L" values="FIR__L" />
            <bitfield caption="64-bit FPU bit" mask="0x00400000" name="F64" values="FIR__F64" />
            <bitfield caption="IEEE-754-2008 bit" mask="0x00800000" name="Has2008" values="FIR__Has2008" />
            <bitfield caption="Full Convert Ranges bit" mask="0x01000000" name="FC" values="FIR__FC" />
            <bitfield caption="User Mode FR Switching Instruction bit" mask="0x10000000" name="UFRP" values="FIR__UFRP" />
         </register>
         <register caption="Floating Point Condition Codes Register; CP1 Register 25" name="FCCR" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="FCC" />
         </register>
         <register caption="Floating Point Exceptions Status Register; CP1 Register 26" name="FEXR" offset="0x234" rw="RW" size="4">
            <bitfield mask="0x0000007C" name="FLAGS" />
            <bitfield mask="0x0003F000" name="CAUSE" />
         </register>
         <register caption="Floating Point Exceptions and Modes Enable Register; CP1 Register 28" name="FENR" offset="0x238" rw="RW" size="4">
            <bitfield caption="Rounding Mode control bits" mask="0x00000003" name="RM" values="FENR__RM" />
            <bitfield caption="Flush to Zero control bit" mask="0x00000004" name="FS" values="FENR__FS" />
            <bitfield mask="0x00000F80" name="ENABLES" />
         </register>
         <register caption="Floating Point Control and Status Register; CP1 Register 31" name="FCSR" offset="0x23c" rw="RW" size="4">
            <bitfield caption="Rounding Mode control bits" mask="0x00000003" name="RM" values="FCSR__RM" />
            <bitfield mask="0x0000007C" name="FLAGS" />
            <bitfield mask="0x00000F80" name="ENABLES" />
            <bitfield mask="0x0003F000" name="CAUSE" />
            <bitfield caption="NaN Encoding control bit" mask="0x00040000" name="NAN2008" values="FCSR__NAN2008" />
            <bitfield caption="Absolute value format control bit" mask="0x00080000" name="ABS2008" values="FCSR__ABS2008" />
            <bitfield caption="Fused Multiply Add mode control bit" mask="0x00100000" name="MAC2008" values="FCSR__MAC2008" />
            <bitfield caption="Flush to Nearest Control bit" mask="0x00200000" name="FN" values="FCSR__FN" />
            <bitfield caption="Flush Override Control bit" mask="0x00400000" name="FO" values="FCSR__FO" />
            <bitfield mask="0x00800000" name="FCC0" />
            <bitfield caption="Flush to Zero control bit" mask="0x01000000" name="FS" values="FCSR__FS" />
            <bitfield mask="0xFE000000" name="FCC" />
         </register>
         <register caption="" name="KScratch1" offset="0x240" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="KScratch1" />
         </register>
         <register caption="" name="KScratch2" offset="0x244" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="KScratch2" />
         </register>
      </register-group>
      <value-group caption="Kseg0 Coherency Algorithm bits" name="Config__K0">
         <value caption="Cacheable, non-coherent, write-back, write allocate" name="" value="0x3" />
         <value caption="Uncached" name="" value="0x2" />
         <value caption="Cacheable, non-coherent, write-through, write allocate" name="" value="0x1" />
         <value caption="Cacheable, non-coherent, write-through, no write allocate" name="" value="0x0" />
      </value-group>
