Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="" name="IPC36" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00030000" name="AD1D40IS" />
            <bitfield mask="0x001C0000" name="AD1D40IP" />
            <bitfield mask="0x03000000" name="AD1D41IS" />
            <bitfield mask="0x1C000000" name="AD1D41IP" />
         </register>
         <register caption="" name="IPC38" offset="0x3A0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D46IS" />
            <bitfield mask="0x0000001C" name="AD1D46IP" />
            <bitfield mask="0x00000300" name="AD1D47IS" />
            <bitfield mask="0x00001C00" name="AD1D47IP" />
            <bitfield mask="0x00030000" name="AD1D48IS" />
            <bitfield mask="0x001C0000" name="AD1D48IP" />
            <bitfield mask="0x03000000" name="AD1D49IS" />
            <bitfield mask="0x1C000000" name="AD1D49IP" />
         </register>
         <register caption="" name="IPC39" offset="0x3B0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D50IS" />
            <bitfield mask="0x0000001C" name="AD1D50IP" />
            <bitfield mask="0x00000300" name="AD1D51IS" />
            <bitfield mask="0x00001C00" name="AD1D51IP" />
            <bitfield mask="0x00030000" name="AD1D52IS" />
            <bitfield mask="0x001C0000" name="AD1D52IP" />
            <bitfield mask="0x03000000" name="AD1D53IS" />
            <bitfield mask="0x1C000000" name="AD1D53IP" />
         </register>
         <register caption="" name="IPC40" offset="0x3C0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CMP3IS" />
            <bitfield mask="0x0000001C" name="CMP3IP" />
            <bitfield mask="0x00000300" name="CMP4IS" />
            <bitfield mask="0x00001C00" name="CMP4IP" />
            <bitfield mask="0x00030000" name="CMP5IS" />
            <bitfield mask="0x001C0000" name="CMP5IP" />
         </register>
         <register caption="" name="IPC41" offset="0x3D0" rw="RW" size="4">
            <bitfield mask="0x03000000" name="CAN1IS" />
            <bitfield mask="0x1C000000" name="CAN1IP" />
         </register>
         <register caption="" name="IPC42" offset="0x3E0" rw="RW" size="4">
            <bitfield mask="0x00000300" name="QEI1IS" />
            <bitfield mask="0x00001C00" name="QEI1IP" />
            <bitfield mask="0x00030000" name="QEI2IS" />
            <bitfield mask="0x001C0000" name="QEI2IP" />
            <bitfield mask="0x03000000" name="PWMPEVTIS" />
            <bitfield mask="0x1C000000" name="PWMPEVTIP" />
         </register>
         <register caption="" name="IPC43" offset="0x3F0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PWMSEVTIS" />
            <bitfield mask="0x0000001C" name="PWMSEVTIP" />
            <bitfield mask="0x00000300" name="PWM1IS" />
            <bitfield mask="0x00001C00" name="PWM1IP" />
            <bitfield mask="0x00030000" name="PWM2IS" />
            <bitfield mask="0x001C0000" name="PWM2IP" />
            <bitfield mask="0x03000000" name="PWM3IS" />
            <bitfield mask="0x1C000000" name="PWM3IP" />
         </register>
         <register caption="" name="IPC44" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PWM4IS" />
            <bitfield mask="0x0000001C" name="PWM4IP" />
            <bitfield mask="0x00000300" name="PWM5IS" />
            <bitfield mask="0x00001C00" name="PWM5IP" />
            <bitfield mask="0x00030000" name="PWM6IS" />
            <bitfield mask="0x001C0000" name="PWM6IP" />
         </register>
         <register caption="" name="IPC45" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00030000" name="DMA4IS" />
            <bitfield mask="0x001C0000" name="DMA4IP" />
            <bitfield mask="0x03000000" name="DMA5IS" />
            <bitfield mask="0x1C000000" name="DMA5IP" />
         </register>
         <register caption="" name="IPC46" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA6IS" />
            <bitfield mask="0x0000001C" name="DMA6IP" />
            <bitfield mask="0x00000300" name="DMA7IS" />
            <bitfield mask="0x00001C00" name="DMA7IP" />
         </register>
         <register caption="" name="IPC47" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00000300" name="QEI3IS" />
            <bitfield mask="0x00001C00" name="QEI3IP" />
         </register>
         <register caption="" name="IPC57" offset="0x4D0" rw="RW" size="4">
            <bitfield mask="0x00030000" name="SBIS" />
            <bitfield mask="0x001C0000" name="SBIP" />
         </register>
         <register caption="" name="IPC59" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00030000" name="PWM7IS" />
            <bitfield mask="0x001C0000" name="PWM7IP" />
            <bitfield mask="0x03000000" name="PWM8IS" />
            <bitfield mask="0x1C000000" name="PWM8IP" />
         </register>
         <register caption="" name="IPC60" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PWM9IS" />
            <bitfield mask="0x0000001C" name="PWM9IP" />
         </register>
         <register caption="" name="IPC61" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x00000300" name="AD1DC3IS" />
            <bitfield mask="0x00001C00" name="AD1DC3IP" />
            <bitfield mask="0x00030000" name="AD1DC4IS" />
            <bitfield mask="0x001C0000" name="AD1DC4IP" />
            <bitfield mask="0x03000000" name="PCACHEIS" />
            <bitfield mask="0x1C000000" name="PCACHEIP" />
         </register>
         <register caption="" name="IPC62" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00000300" name="CLC1IS" />
            <bitfield mask="0x00001C00" name="CLC1IP" />
            <bitfield mask="0x00030000" name="CLC2IS" />
            <bitfield mask="0x001C0000" name="CLC2IP" />
            <bitfield mask="0x03000000" name="CLC3IS" />
            <bitfield mask="0x1C000000" name="CLC3IP" />
         </register>
         <register caption="" name="IPC63" offset="0x530" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CLC4IS" />
            <bitfield mask="0x0000001C" name="CLC4IP" />
            <bitfield mask="0x00030000" name="CPCIS" />
            <bitfield mask="0x001C0000" name="CPCIP" />
            <bitfield mask="0x03000000" name="CFDCIS" />
            <bitfield mask="0x1C000000" name="CFDCIP" />
         </register>
         <register caption="" name="OFF000" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF001" offset="0x544" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
