Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
   <module caption="" id="01477" name="MCPWM" version="1">
      <register-group name="MCPWM">
         <register caption="PWM Primary Time Base Control Register" name="PTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="PWM Special Event Trigger Output Postscaler Select bits" mask="0x0000000F" name="SEVTPS" values="PTCON__SEVTPS" />
            <bitfield caption="Primary PWM Input Clock Prescaler bits" mask="0x00000070" name="PCLKDIV" values="PTCON__PCLKDIV" />
            <bitfield caption="PWM Module Status bit" mask="0x00000400" name="PWMRDY" values="PTCON__PWMRDY" />
            <bitfield caption="Special Event Interrupt Enable bit" mask="0x00000800" name="SEIEN" values="PTCON__SEIEN" />
            <bitfield caption="Special Event Interrupt Status bit" mask="0x00001000" name="SESTAT" values="PTCON__SESTAT" />
            <bitfield caption="PWM Time Base Stop in Idle Mode bit" mask="0x00002000" name="PTSIDL" values="PTCON__PTSIDL" />
            <bitfield caption="PWM Module Enable bit" mask="0x00008000" name="PTEN" values="PTCON__PTEN" />
         </register>
         <register caption="Primary Master Time Base Period Register" name="PTPER" offset="0x10" rw="RW" size="4">
            <bitfield caption="Primary Master Time Base Period Value bits" mask="0x0000FFFF" name="PTPER" values="PTPER__PTPER" />
         </register>
         <register caption="PWM Primary Special Event Compare Register" name="SEVTCMP" offset="0x20" rw="RW" size="4">
            <bitfield caption="Special Event Compare Count Value bits" mask="0x0000FFFF" name="SEVTCMP" values="SEVTCMP__SEVTCMP" />
         </register>
         <register caption="Primary Master Time Base Timer Register" name="PMTMR" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PMTMR" />
         </register>
         <register caption="Secondary Master Time Base Control Register" name="STCON" offset="0x40" rw="RW" size="4">
            <bitfield caption="PWM Secondary Special Event Trigger Output Postscaler Select bits" mask="0x0000000F" name="SEVTPS" values="STCON__SEVTPS" />
            <bitfield caption="Secondary PWM Input Clock Prescaler" mask="0x00000070" name="SCLKDIV" values="STCON__SCLKDIV" />
            <bitfield caption="Secondary Special Event Interrupt Enable bit" mask="0x00000800" name="SSEIEN" values="STCON__SSEIEN" />
            <bitfield caption="Secondary Special Event Interrupt Status bit" mask="0x00001000" name="SSESTAT" values="STCON__SSESTAT" />
         </register>
         <register caption="Secondary Master Time Base Period Register" name="STPER" offset="0x50" rw="RW" size="4">
            <bitfield caption="Secondary Master Time Base Period Value bits" mask="0x0000FFFF" name="STPER" values="STPER__STPER" />
         </register>
         <register caption="PWM Secondary Special Event Compare Register" name="SSEVTCMP" offset="0x60" rw="RW" size="4">
            <bitfield caption="Secondary Special Event Compare Value bits" mask="0x0000FFFF" name="SSEVTCMP" values="SSEVTCMP__SSEVTCMP" />
         </register>
         <register caption="Secondary Master Time Base Timer Register" name="SMTMR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SMTMR" />
         </register>
         <register caption="PWM Chop Clock Generator Register" name="CHOP" offset="0x80" rw="RW" size="4">
            <bitfield caption="Chop Clock Divider bits" mask="0x000003FF" name="CHOPCLK" values="CHOP__CHOPCLK" />
            <bitfield caption="Enable Chop Clock Generator bit" mask="0x00008000" name="CHPCLKEN" values="CHOP__CHPCLKEN" />
         </register>
         <register caption="PWM Unlock Register" name="PWMKEY" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PWMKEY" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON1" offset="0xc0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON1__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON1__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON1__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON1__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON1__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON1__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON1__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON1__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON1__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON1__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON1__PWMLIEN" />
            <bitfield caption="Primary Trigger Interrupt Enable bit" mask="0x00200000" name="TRGIEN" values="PWMCON1__TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON1__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON1__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON1__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON1__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON1__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON1__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON1__FLTIF" />
         </register>
