Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC1" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC2" offset="0x1e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC3" offset="0x2e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC4" offset="0x3e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC5" offset="0x4e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC6" offset="0x5e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC1" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC2" offset="0x1f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC3" offset="0x2f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC4" offset="0x3f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC5" offset="0x4f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC6" offset="0x5f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE1" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE2" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE3" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE4" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE5" offset="0x500" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE6" offset="0x600" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR1" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR2" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR3" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR4" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR5" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR6" offset="0x610" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR1" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR2" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR3" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR4" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR5" offset="0x520" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR6" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP1" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP2" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP3" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP4" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP5" offset="0x530" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
