Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP6" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="PWM Primary Trigger Compare Value Register x (x = 1 through 12)" name="TRIG1" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="PWM Primary Trigger Compare Value Register x (x = 1 through 12)" name="TRIG2" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="PWM Primary Trigger Compare Value Register x (x = 1 through 12)" name="TRIG3" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="PWM Primary Trigger Compare Value Register x (x = 1 through 12)" name="TRIG4" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="PWM Primary Trigger Compare Value Register x (x = 1 through 12)" name="TRIG5" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="PWM Primary Trigger Compare Value Register x (x = 1 through 12)" name="TRIG6" offset="0x640" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON1" offset="0x150" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON1__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON1__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON1__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON1__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON1__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON2" offset="0x250" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON2__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON2__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON2__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON2__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON2__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON3" offset="0x350" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON3__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON3__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON3__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON3__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON3__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON4" offset="0x450" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON4__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON4__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON4__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON4__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON4__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON5" offset="0x550" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON5__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON5__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON5__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON5__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON5__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON6" offset="0x650" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON6__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON6__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON6__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON6__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON6__TRGDIV" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG1" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG2" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG3" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
