Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY4" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY5" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY6" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON1" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON1__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON1__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON1__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON2" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON2__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON2__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON2__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON3" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON3__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON3__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON3__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON4" offset="0x4a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON4__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON4__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON4__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON5" offset="0x5a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON5__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON5__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON5__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON6" offset="0x6a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON6__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON6__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON6__CHOPSEL" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR1" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR2" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR3" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR4" offset="0x4b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR5" offset="0x5b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR6" offset="0x6b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
      </register-group>
      <value-group caption="Primary Master Time Base Period Value bits" name="PTPER__PTPER">
         <value caption="Minimum value" name="" value="0x8" />
      </value-group>
      <value-group caption="Special Event Compare Count Value bits" name="SEVTCMP__SEVTCMP">
         <value caption="trigger at period boundary" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Special Event Trigger Output Postscaler Select bits" name="PTCON__SEVTPS">
         <value caption="1:16 postscaler generates Special Event trigger at every 16th compare match event" name="" value="0xf" />
         <value caption="1:15 postscaler generates Special Event trigger at every 15th compare match event" name="" value="0xe" />
         <value caption="1:14 postscaler generates Special Event trigger at every 14th compare match event" name="" value="0xd" />
         <value caption="1:13 postscaler generates Special Event trigger at every 13th compare match event" name="" value="0xc" />
         <value caption="1:12 postscaler generates Special Event trigger at every 12th compare match event" name="" value="0xb" />
         <value caption="1:11 postscaler generates Special Event trigger at every 11th compare match event" name="" value="0xa" />
         <value caption="1:10 postscaler generates Special Event trigger at every 10th compare match event" name="" value="0x9" />
         <value caption="1:9 postscaler generates Special Event trigger at every 9th compare match event" name="" value="0x8" />
         <value caption="1:8 postscaler generates Special Event trigger at every 8th compare match event" name="" value="0x7" />
         <value caption="1:7 postscaler generates Special Event trigger at every 7th compare match event" name="" value="0x6" />
         <value caption="1:6 postscaler generates Special Event trigger at every 6th compare match event" name="" value="0x5" />
         <value caption="1:5 postscaler generates Special Event trigger at every 5th compare match event" name="" value="0x4" />
         <value caption="1:4 postscaler generates Special Event trigger at every 4th compare match event" name="" value="0x3" />
         <value caption="1:3 postscaler generates Special Event trigger at every 3rd compare match event" name="" value="0x2" />
         <value caption="1:2 postscaler generates Special Event trigger at every second compare match event" name="" value="0x1" />
         <value caption="1:1 postscaler generates Special Event trigger at every compare match event" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary PWM Input Clock Prescaler bits" name="PTCON__PCLKDIV">
         <value caption="Divide by 128" name="" value="0x7" />
         <value caption="Divide by 64" name="" value="0x6" />
         <value caption="Divide by 32" name="" value="0x5" />
         <value caption="Divide by 16" name="" value="0x4" />
         <value caption="Divide by 8" name="" value="0x3" />
         <value caption="Divide by 4" name="" value="0x2" />
         <value caption="Divide by 2" name="DIV_2" value="0x1" />
         <value caption="Divide by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="PWM Module Status bit" name="PTCON__PWMRDY">
         <value caption="PWM module is ready and operation has begun" name="" value="0x1" />
         <value caption="PWM module is not ready" name="" value="0x0" />
      </value-group>
