Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
      <value-group caption="Special Event Interrupt Enable bit" name="PTCON__SEIEN">
         <value caption="Special Event Interrupt is enabled" name="" value="0x1" />
         <value caption="Special Event Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Special Event Interrupt Status bit" name="PTCON__SESTAT">
         <value caption="Special Event Interrupt is pending" name="" value="0x1" />
         <value caption="Special Event Interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Time Base Stop in Idle Mode bit" name="PTCON__PTSIDL">
         <value caption="PWM time base halts in CPU Idle mode" name="" value="0x1" />
         <value caption="PWM time base runs in CPU Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Module Enable bit" name="PTCON__PTEN">
         <value caption="PWM module is enabled" name="" value="0x1" />
         <value caption="PWM module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Master Time Base Period Value bits" name="STPER__STPER">
         <value caption="Minimum value" name="" value="0x8" />
      </value-group>
      <value-group caption="Secondary Special Event Compare Value bits" name="SSEVTCMP__SSEVTCMP">
         <value caption="Trigger at period boundary" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Secondary Special Event Trigger Output Postscaler Select bits" name="STCON__SEVTPS">
         <value caption="1:16 Postscale" name="" value="0xf" />
         <value caption="1:15 Postscale" name="" value="0xe" />
         <value caption="1:14 Postscale" name="" value="0xd" />
         <value caption="1:13 Postscale" name="" value="0xc" />
         <value caption="1:12 Postscale" name="" value="0xb" />
         <value caption="1:11 Postscale" name="" value="0xa" />
         <value caption="1:10 Postscale" name="" value="0x9" />
         <value caption="1:9 Postscale" name="" value="0x8" />
         <value caption="1:8 Postscale" name="" value="0x7" />
         <value caption="1:7 Postscale" name="" value="0x6" />
         <value caption="1:6 Postscale" name="" value="0x5" />
         <value caption="1:5 Postscale" name="" value="0x4" />
         <value caption="1:4 Postscale" name="" value="0x3" />
         <value caption="1:3 Postscale" name="" value="0x2" />
         <value caption="1:2 Postscale" name="" value="0x1" />
         <value caption="1:1 Postscale" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary PWM Input Clock Prescaler" name="STCON__SCLKDIV">
         <value caption="Divide by 128" name="" value="0x7" />
         <value caption="Divide by 64" name="" value="0x6" />
         <value caption="Divide by 32" name="" value="0x5" />
         <value caption="Divide by 16" name="" value="0x4" />
         <value caption="Divide by 8" name="" value="0x3" />
         <value caption="Divide by 4" name="" value="0x2" />
         <value caption="Divide by 2" name="DIV_2" value="0x1" />
         <value caption="Divide by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Secondary Special Event Interrupt Enable bit" name="STCON__SSEIEN">
         <value caption="Secondary Special Event Interrupt is enabled" name="" value="0x1" />
         <value caption="Secondary Special Event Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Special Event Interrupt Status bit" name="STCON__SSESTAT">
         <value caption="Secondary Special Event Interrupt is pending" name="" value="0x1" />
         <value caption="Secondary Special Event Interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Chop Clock Divider bits" name="CHOP__CHOPCLK">
         <value caption="Minimum value" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Chop Clock Generator bit" name="CHOP__CHPCLKEN">
         <value caption="Chop clock generator is enabled" name="" value="0x1" />
         <value caption="Chop clock generator is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="External PWM Reset Control bit" name="PWMCON1__XPRES">
         <value caption="Current-limit source resets primary local time base for this PWM generator if it is in Independent Time Base mode and the PWM module enters the deassertion portion of the duty cycle" name="" value="0x1" />
         <value caption="External pins do not affect PWM time base" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Time Base Select bit" name="PWMCON1__MTBS">
         <value caption="Secondary master time base is the clock source for the MCPWM module" name="" value="0x1" />
         <value caption="Primary master time base is the clock source for the MCPWM module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Timer Direction bit" name="PWMCON1__PTDIR">
         <value caption="PWM timer is decrementing" name="" value="0x1" />
         <value caption="PWM timer is incrementing" name="" value="0x0" />
      </value-group>
      <value-group caption="Dead Time Compensation Polarity bit" name="PWMCON1__DTCP">
         <value caption="(If DTCMPx pin is 0)PWMxL is shortened, and PWMxH is lengthened / (If DTCMPx pin is 1)PWMxH is shortened, and PWMxL is lengthened" name="" value="0x1" />
         <value caption="(If DTCMPx pin is 0)PWMxH is shortened, and PWMxL is lengthened / (If DTCMPx pin is 1)PWMxL is shortened, and PWMxH is lengthened" name="" value="0x0" />
      </value-group>
      <value-group caption="Dead Time Control bits" name="PWMCON1__DTC">
         <value caption="Dead Time Compensation mode enabled" name="" value="0x3" />
         <value caption="Dead time function is disabled" name="" value="0x2" />
         <value caption="Negative dead time actively applied for Complementary Output mode(5)" name="" value="0x1" />
         <value caption="Positive dead time actively applied for all output modes" name="" value="0x0" />
      </value-group>
