Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
      <value-group caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" name="TRGCON2__STRGSEL">
         <value caption="When a secondary PWM trigger comparison match event occurs in the second half of a dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a secondary PWM trigger comparison match event occurs in the first half of a dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a secondary PWM trigger comparison match event occurs, generate a secondary PWM trigger event output if the trigger divider has counted the appropriate number of raw secondary PWM trigger events." name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" name="TRGCON2__TRGSEL">
         <value caption="When a trigger comparison match event occurs in the incrementing phase in the dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a trigger comparison match event occurs in the decrementing phase in the dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a trigger comparison match event occurs, generate a trigger event output if the trigger divider has counted the appropriate number of raw trigger events." name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger x Output Divider bits" name="TRGCON2__TRGDIV">
         <value caption="Trigger output for every sixteenth trigger event" name="" value="0xf" />
         <value caption="Trigger output for every 15th trigger event" name="" value="0xe" />
         <value caption="Trigger output for every 14th trigger event" name="" value="0xd" />
         <value caption="Trigger output for every 13th trigger event" name="" value="0xc" />
         <value caption="Trigger output for every 12th trigger event" name="" value="0xb" />
         <value caption="Trigger output for every 11th trigger event" name="" value="0xa" />
         <value caption="Trigger output for every 10th trigger event" name="" value="0x9" />
         <value caption="Trigger output for every 9th trigger event" name="" value="0x8" />
         <value caption="Trigger output for every 8th trigger event" name="" value="0x7" />
         <value caption="Trigger output for every 7th trigger event" name="" value="0x6" />
         <value caption="Trigger output for every 6th trigger event" name="" value="0x5" />
         <value caption="Trigger output for every 5th trigger event" name="" value="0x4" />
         <value caption="Trigger output for every 4th trigger event" name="" value="0x3" />
         <value caption="Trigger output for every 3rd trigger event" name="" value="0x2" />
         <value caption="Trigger output for every second trigger event" name="" value="0x1" />
         <value caption="Trigger output for every trigger event" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Trigger Interrupt Select" name="TRGCON3__STRGIS">
         <value caption="Selects the Secondary Trigger Register (STRIGx) based events for interrupts" name="" value="0x1" />
         <value caption="(When the DTM bit (TRGCONx) is clear (is 0)) TRIGx-based events for interrupts are selected / (When the DTM bit is set (is 1))the logical OR of both STRIGx and TRIGx based triggers for interrupts are selected." name="" value="0x0" />
      </value-group>
      <value-group caption="Dual ADC Trigger Mode" name="TRGCON3__DTM">
         <value caption="Secondary trigger event is combined with the primary trigger event for purposes of creating a combined ADC trigger" name="" value="0x1" />
         <value caption="Secondary trigger event is not combined with the primary trigger event for purposes of creating a combined ADC trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" name="TRGCON3__STRGSEL">
         <value caption="When a secondary PWM trigger comparison match event occurs in the second half of a dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a secondary PWM trigger comparison match event occurs in the first half of a dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a secondary PWM trigger comparison match event occurs, generate a secondary PWM trigger event output if the trigger divider has counted the appropriate number of raw secondary PWM trigger events." name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" name="TRGCON3__TRGSEL">
         <value caption="When a trigger comparison match event occurs in the incrementing phase in the dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a trigger comparison match event occurs in the decrementing phase in the dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a trigger comparison match event occurs, generate a trigger event output if the trigger divider has counted the appropriate number of raw trigger events." name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger x Output Divider bits" name="TRGCON3__TRGDIV">
         <value caption="Trigger output for every sixteenth trigger event" name="" value="0xf" />
         <value caption="Trigger output for every 15th trigger event" name="" value="0xe" />
         <value caption="Trigger output for every 14th trigger event" name="" value="0xd" />
         <value caption="Trigger output for every 13th trigger event" name="" value="0xc" />
         <value caption="Trigger output for every 12th trigger event" name="" value="0xb" />
         <value caption="Trigger output for every 11th trigger event" name="" value="0xa" />
         <value caption="Trigger output for every 10th trigger event" name="" value="0x9" />
         <value caption="Trigger output for every 9th trigger event" name="" value="0x8" />
         <value caption="Trigger output for every 8th trigger event" name="" value="0x7" />
         <value caption="Trigger output for every 7th trigger event" name="" value="0x6" />
         <value caption="Trigger output for every 6th trigger event" name="" value="0x5" />
         <value caption="Trigger output for every 5th trigger event" name="" value="0x4" />
         <value caption="Trigger output for every 4th trigger event" name="" value="0x3" />
         <value caption="Trigger output for every 3rd trigger event" name="" value="0x2" />
         <value caption="Trigger output for every second trigger event" name="" value="0x1" />
         <value caption="Trigger output for every trigger event" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Trigger Interrupt Select" name="TRGCON4__STRGIS">
         <value caption="Selects the Secondary Trigger Register (STRIGx) based events for interrupts" name="" value="0x1" />
         <value caption="(When the DTM bit (TRGCONx) is clear (is 0)) TRIGx-based events for interrupts are selected / (When the DTM bit is set (is 1))the logical OR of both STRIGx and TRIGx based triggers for interrupts are selected." name="" value="0x0" />
      </value-group>
      <value-group caption="Dual ADC Trigger Mode" name="TRGCON4__DTM">
         <value caption="Secondary trigger event is combined with the primary trigger event for purposes of creating a combined ADC trigger" name="" value="0x1" />
         <value caption="Secondary trigger event is not combined with the primary trigger event for purposes of creating a combined ADC trigger" name="" value="0x0" />
      </value-group>
