Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON4__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON4__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON4__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON5__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON5__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON5__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON6__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON6__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON6__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02819" name="NVM" version="2">
      <register-group name="NVM">
         <register caption="Flash Programming Control Register" name="NVMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="NVM Operation bits" mask="0x0000000F" name="NVMOP" values="NVMCON__NVMOP" />
            <bitfield caption="Low-Voltage Detect Error bit" mask="0x00001000" name="LVDERR" values="NVMCON__LVDERR" />
            <bitfield caption="Write Error bit" mask="0x00002000" name="WRERR" values="NVMCON__WRERR" />
            <bitfield caption="Write Enable bit" mask="0x00004000" name="WREN" values="NVMCON__WREN" />
            <bitfield caption="Write Control bit" mask="0x00008000" name="WR" values="NVMCON__WR" />
         </register>
         <register caption="Programming Unlock Register" name="NVMKEY" offset="0x10" rw="W" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMKEY" />
         </register>
         <register caption="Flash Address Register" name="NVMADDR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMADDR" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA0" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA0" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA1" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA2" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA3" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA3" />
         </register>
