Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="Source Data Address Register" name="NVMSRCADDR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMSRCADDR" />
         </register>
         <register caption="Program Flash Write-Protect Register" name="NVMPWP" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00FFFFFF" name="PWP" />
            <bitfield caption="Program Flash Memory Page Write-protect Unlock bit" mask="0x80000000" name="PWPULOCK" values="NVMPWP__PWPULOCK" />
         </register>
         <register caption="Flash Boot (Page) Write-Protect Register" name="NVMBWP" offset="0x90" rw="RW" size="4">

            <bitfield caption="Boot Alias Page 0 Write-protect bit" mask="0x00000100" name="BWP0" values="NVMBWP__BWP0" />
            <bitfield caption="Boot Alias Page 1 Write-protect bit" mask="0x00000200" name="BWP1" values="NVMBWP__BWP1" />
            <bitfield caption="Boot Alias Page 2 Write-protect bit" mask="0x00000400" name="BWP2" values="NVMBWP__BWP2" />
            <bitfield caption="Boot Alias Page 3 Write-protect bit" mask="0x00000800" name="BWP3" values="NVMBWP__BWP3" />
            <bitfield caption="Boot Alias Page 4 Write-protect bit" mask="0x00001000" name="BWP4" values="NVMBWP__BWP4" />
            <bitfield caption="Lower Boot Alias Write-protect Unlock bit" mask="0x00008000" name="BWPULOCK" values="NVMBWP__BWPULOCK" />
         </register>
         <register caption="Flash Programming Control Register 2" name="NVMCON2" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Erase Retry Control bits" mask="0x00000300" name="ERETRY" values="NVMCON2__ERETRY" />
            <bitfield caption="Verify Read of Logic 1 Control bit" mask="0x00001000" name="VREAD1" values="NVMCON2__VREAD1" />
            <bitfield caption="Compare Read of Logic 1 bit" mask="0x00002000" name="CREAD1" values="NVMCON2__CREAD1" />
            <bitfield caption="Low-Power Read Control bit" mask="0x00008000" name="LPRD" values="NVMCON2__LPRD" />
            <bitfield caption="Wait State bits" mask="0x001F0000" name="LPRDWS" values="NVMCON2__LPRDWS" />
            <bitfield mask="0xF0000000" name="ERSCNT" />
         </register>
      </register-group>
      <value-group caption="NVM Operation bits" name="NVMCON__NVMOP">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Program erase operation: erase all of program Flash memory (all pages must be unprotected)" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Program Flash memory erase operation: erases all of Program Flash" name="" value="0x5" />
         <value caption="Page erase operation: erases page selected by NVMADDR" name="" value="0x4" />
         <value caption="Row program operation: programs row selected by NVMADDR" name="" value="0x3" />
         <value caption="Quad Word (128-bit) program operation: programs the 128-bit Flash word selected by NVMADDR" name="" value="0x2" />
         <value caption="Word program operation: programs word selected by NVMADDR" name="" value="0x1" />
         <value caption="No operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Voltage Detect Error bit" name="NVMCON__LVDERR">
         <value caption="Low-voltage detected (possible data corruption if WRERR is set)" name="" value="0x1" />
         <value caption="Voltage level is acceptable for programming" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Error bit" name="NVMCON__WRERR">
         <value caption="Program or erase sequence did not complete successfully" name="" value="0x1" />
         <value caption="Program or erase sequence completed normally" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Enable bit" name="NVMCON__WREN">
         <value caption="Enable writes to the WR bit and disables writes to the NVMOP bits" name="" value="0x1" />
         <value caption="Disable writes to WR bit and enables writes to the NVMOP bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Control bit" name="NVMCON__WR">
         <value caption="Initiate a Flash operation" name="" value="0x1" />
         <value caption="Flash operation is complete or inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Program Flash Memory Page Write-protect Unlock bit" name="NVMPWP__PWPULOCK">
         <value caption="Register is not locked and can be modified" name="" value="0x1" />
         <value caption="Register is locked and cannot be modified" name="" value="0x0" />
      </value-group>

      <value-group caption="Boot Alias Page 0 Write-protect bit" name="NVMBWP__BWP0">
         <value caption="Write protection for physical address 0x01FC00000 through 0x1FC03FFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC00000 through 0x1FC03FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Boot Alias Page 1 Write-protect bit" name="NVMBWP__BWP1">
         <value caption="Write protection for physical address 0x01FC04000 through 0x1FC07FFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC04000 through 0x1FC07FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Boot Alias Page 2 Write-protect bit" name="NVMBWP__BWP2">
         <value caption="Write protection for physical address 0x01FC08000 through 0x1FC0BFFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC08000 through 0x1FC0BFFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Boot Alias Page 3 Write-protect bit" name="NVMBWP__BWP3">
         <value caption="Write protection for physical address 0x01FC0C000 through 0x1FC0FFFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC0C000 through 0x1FC0FFFF disabled" name="" value="0x0" />
      </value-group>
