Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="CACHE Miss Status Register" name="CHEMIS" offset="0x30" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEMIS" />
         </register>
      </register-group>
      <value-group caption="PFM Access Time Defined in Terms of SYSCLK Wait States bits" name="CHECON__PFMWS">
         <value caption="Seven Wait states" name="" value="0x7" />
         <value caption="Six Wait states" name="" value="0x6" />
         <value caption="Five Wait states" name="" value="0x5" />
         <value caption="Four Wait states" name="" value="0x4" />
         <value caption="Three Wait states" name="" value="0x3" />
         <value caption="Two Wait states" name="" value="0x2" />
         <value caption="One Wait state" name="" value="0x1" />
         <value caption="Zero Wait states" name="" value="0x0" />
      </value-group>
      <value-group caption="Predictive Prefetch Enable bits" name="CHECON__PREFEN">
         <value caption="Enable predictive prefetch for CPU instructions only" name="" value="0x1" />
         <value caption="Disable predictive prefetch" name="" value="0x0" />
      </value-group>
      <value-group caption="PFM Address Wait State Enable bit" name="CHECON__PFMAWSEN">
         <value caption="Add one more Wait State to flash address setup (suggested for higher system clock frequencies)" name="" value="0x1" />
         <value caption="Add no Wait States to the flash address setup (suggested for lower system clock frequencies to achieve higher performance)" name="" value="0x0" />
      </value-group>
      <value-group caption="Cache Performance Counters Enable bit" name="CHECON__CHEPERFEN">
         <value caption="Performance counters are enabled" name="" value="0x1" />
         <value caption="Performance counters are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Instruction Auto-cache Coherency Control bit" name="CHECON__ICHECOH">
         <value caption="Automatically invalidate cache on a programming event" name="" value="0x1" />
         <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Auto-cache Coherency Control bit" name="CHECON__DCHECOH">
         <value caption="Automatically invalidate cache on a programming event" name="" value="0x1" />
         <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Auto-cache Coherency Control bit" name="CHECON__PERCHECOH">
         <value caption="Automatically invalidate cache on a programming event" name="" value="0x1" />
         <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0" />
      </value-group>
      <value-group caption="Instruction Cache Invalidate bit" name="CHECON__ICHEINV">
         <value caption="Force invalidate cache/invalidate busy" name="" value="0x1" />
         <value caption="Cache Invalidation follows CHECOH/invalid complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Cache Invalidate bit" name="CHECON__DCHEINV">
         <value caption="Force invalidate cache/invalidate busy" name="" value="0x1" />
         <value caption="Cache Invalidation follows CHECOH/invalid complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Cache Invalidate bit" name="CHECON__PERCHEINV">
         <value caption="Force invalidate cache/invalidate busy" name="" value="0x1" />
         <value caption="Cache Invalidation follows CHECOH/invalid complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Instruction Cache Enable bit" name="CHECON__ICHEEN">
         <value caption="Instruction cache is enabled" name="" value="0x1" />
         <value caption="Instruction cache is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Cache Enable bit" name="CHECON__DCHEEN">
         <value caption="Data cache is enabled" name="" value="0x1" />
         <value caption="Data cache is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Cache Enable bit" name="CHECON__PERCHEEN">
         <value caption="Peripheral cache is enabled" name="" value="0x1" />
         <value caption="Peripheral cache is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01494" name="QEI" version="1">
      <register-group name="QEI">
         <register caption="QEIx Control Register" name="QEI1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI1CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI1CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI1CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI1CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI1CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI1CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI1CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI1CON__QEIEN" />
         </register>
         <register caption="QEIx Control Register" name="QEI2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI2CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI2CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI2CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI2CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI2CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI2CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI2CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI2CON__QEIEN" />
         </register>
         <register caption="QEIx Control Register" name="QEI3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI3CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI3CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI3CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI3CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI3CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI3CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI3CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI3CON__QEIEN" />
         </register>
