Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
         <register caption="Position Counter Register" name="POS2CNT" offset="0x230" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="Position Counter Register" name="POS3CNT" offset="0x430" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="" name="POS1HLD" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="" name="POS2HLD" offset="0x240" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="" name="POS3HLD" offset="0x440" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="Velocity Counter Register" name="VEL1CNT" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="Velocity Counter Register" name="VEL2CNT" offset="0x250" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="Velocity Counter Register" name="VEL3CNT" offset="0x450" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="Velocity Hold Register" name="VEL1HLD" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="Velocity Hold Register" name="VEL2HLD" offset="0x260" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="Velocity Hold Register" name="VEL3HLD" offset="0x460" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="Interval Timer Register" name="INT1TMR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="Interval Timer Register" name="INT2TMR" offset="0x270" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="Interval Timer Register" name="INT3TMR" offset="0x470" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="Interval Timer Hold Register" name="INT1HLD" offset="0x80" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="Interval Timer Hold Register" name="INT2HLD" offset="0x280" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="Interval Timer Hold Register" name="INT3HLD" offset="0x480" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="" name="INDX1CNT" offset="0x90" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX2CNT" offset="0x290" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX3CNT" offset="0x490" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX1HLD" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="" name="INDX2HLD" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="" name="INDX3HLD" offset="0x4a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI1ICC" offset="0xb0" rw="RW" size="4">
            <bitfield caption="32-bit Initialize/Capture/Compare High bits" mask="0xFFFFFFFF" name="QEIICC" value="QEI1ICC__QEIICC" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI2ICC" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="32-bit Initialize/Capture/Compare High bits" mask="0xFFFFFFFF" name="QEIICC" value="QEI2ICC__QEIICC" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI3ICC" offset="0x4b0" rw="RW" size="4">
            <bitfield caption="32-bit Initialize/Capture/Compare High bits" mask="0xFFFFFFFF" name="QEIICC" value="QEI3ICC__QEIICC" />
         </register>
         <register caption="Capture Low Register" name="QEI1CMPL" offset="0xc0" rw="RW" size="4">
            <bitfield caption="32-bit Compare Low Value bits" mask="0xFFFFFFFF" name="QEICMPL" value="QEI1CMPL__QEICMPL" />
         </register>
         <register caption="Capture Low Register" name="QEI2CMPL" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="32-bit Compare Low Value bits" mask="0xFFFFFFFF" name="QEICMPL" value="QEI2CMPL__QEICMPL" />
         </register>
         <register caption="Capture Low Register" name="QEI3CMPL" offset="0x4c0" rw="RW" size="4">
            <bitfield caption="32-bit Compare Low Value bits" mask="0xFFFFFFFF" name="QEICMPL" value="QEI3CMPL__QEICMPL" />
         </register>
      </register-group>
      <value-group caption="Counter Control Mode Selection bits" name="QEI1CON__CCM">
         <value caption="Internal Timer mode with optional QEB external clock gating input control based on GATEN. QEB High is Timer Run" name="" value="0x3" />
         <value caption="QEA is the external clock input QEB is optional clock gating input control based on GATEN. QEB High is Clock Run, QEB Low is Clock Stop." name="" value="0x2" />
         <value caption="QEA is the external clock input QEB is external UP/DN direction input. (QEB High is Count Up, QEB Low is Count Down)" name="" value="0x1" />
         <value caption="Quadrature Encoder Interface Count mode (x4 mode)" name="" value="0x0" />
      </value-group>
