Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
      <value-group caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" name="QEI2IOC__FLTREN">
         <value caption="Input Pin Digital filter is enabled" name="" value="0x1" />
         <value caption="Input Pin Digital filter is disabled (bypassed)" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Input Capture Enable bit" name="QEI2IOC__QCAPEN">
         <value caption="Positive edge detect of Home input triggers position capture function" name="" value="0x1" />
         <value caption="Home input event (positive edge) does not trigger a capture even" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Input Capture by Home Event Enable bit" name="QEI2IOC__HCAPEN">
         <value caption="HOMEx input event (positive edge) triggers a position capture event" name="" value="0x1" />
         <value caption="HOMEx input event (positive edge) does not trigger a position capture event" name="" value="0x0" />
      </value-group>
      <value-group caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" name="QEI3IOC__QEA">
         <value caption="see datasheet" name="" value="0x1" />
         <value caption="see datasheet" name="" value="0x0" />
      </value-group>
      <value-group caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" name="QEI3IOC__QEB">
         <value caption="see datasheet" name="" value="0x1" />
         <value caption="see datasheet" name="" value="0x0" />
      </value-group>
      <value-group caption="Status of INDXx Input Pin after Polarity Control bit" name="QEI3IOC__INDEX">
         <value caption="(if IDXPOL bit is set to 0) Pin is at logic 1 / (if IDXPOL bit is set to 1) Pin is at logic 0" name="" value="0x1" />
         <value caption="(if IDXPOL bit is set to 0) Pin is at logic 0 / (if IDXPOL bit is set to 1) Pin is at logic 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Status of HOMEx Input Pin after Polarity Control bit" name="QEI3IOC__HOME">
         <value caption="(if HOMPOL bit is set to 0) Pin is at logic 1 / (if HOMPOL bit is set to 1) Pin is at logic 0" name="" value="0x1" />
         <value caption="(if HOMPOL bit is set to 0) Pin is at logic 0 / (if HOMPOL bit is set to 1) Pin is at logic 1" name="" value="0x0" />
      </value-group>
      <value-group caption="QEAx Input Polarity Select bit" name="QEI3IOC__QEAPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="QEBx Input Polarity Select bit" name="QEI3IOC__QEBPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="INDXx Input Polarity Select bit" name="QEI3IOC__IDXPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="HOMEx Input Polarity Select bit" name="QEI3IOC__HOMPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Swap QEA and QEB Inputs bit" name="QEI3IOC__SWPAB">
         <value caption="QEAx and QEBx are swapped prior to quadrature decoder logic" name="" value="0x1" />
         <value caption="QEAx and QEBx are not swapped" name="" value="0x0" />
      </value-group>
      <value-group caption="QEI Module Output Function Mode Select bits" name="QEI3IOC__OUTFNC">
         <value caption="The CNTCMPx pin goes high when POSxCNT QEIxCMPL or POSxCNT  QEIxICCH" name="" value="0x3" />
         <value caption="The CNTCMPx pin goes high when POSxCNT  QEIxCMPL" name="" value="0x2" />
         <value caption="The CNTCMPx pin goes high when POSxCNT QEIxICCH" name="" value="0x1" />
         <value caption="Output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" name="QEI3IOC__QFDIV">
         <value caption="1:128 clock divide" name="" value="0x7" />
         <value caption="1:64 clock divide" name="" value="0x6" />
         <value caption="1:32 clock divide" name="" value="0x5" />
         <value caption="1:16 clock divide" name="" value="0x4" />
         <value caption="1:8 clock divide" name="" value="0x3" />
         <value caption="1:4 clock divide" name="" value="0x2" />
         <value caption="1:2 clock divide" name="" value="0x1" />
         <value caption="1:1 clock divide" name="" value="0x0" />
      </value-group>
      <value-group caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" name="QEI3IOC__FLTREN">
         <value caption="Input Pin Digital filter is enabled" name="" value="0x1" />
         <value caption="Input Pin Digital filter is disabled (bypassed)" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Input Capture Enable bit" name="QEI3IOC__QCAPEN">
         <value caption="Positive edge detect of Home input triggers position capture function" name="" value="0x1" />
         <value caption="Home input event (positive edge) does not trigger a capture even" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Input Capture by Home Event Enable bit" name="QEI3IOC__HCAPEN">
         <value caption="HOMEx input event (positive edge) triggers a position capture event" name="" value="0x1" />
         <value caption="HOMEx input event (positive edge) does not trigger a position capture event" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Input Event Interrupt Enable bit" name="QEI1STAT__IDXIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
