Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0256MCJ048.atdf
      <value-group caption="Multiple Permission Violations Status bit" name="SBT3ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1" />
         <value caption="No multiple errors have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT0ELOG2__GROUP">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0 (default group of CPU at Reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT1ELOG2__GROUP">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0 (default group of CPU at Reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT2ELOG2__GROUP">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0 (default group of CPU at Reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT3ELOG2__GROUP">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0 (default group of CPU at Reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT0ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT1ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT2ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT3ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT0REG0__SIZE">
         <value caption="Region size is 549755813888 bytes" name="" value="0x1e" />
         <value caption="Region size is 274877906944 bytes" name="" value="0x1d" />
         <value caption="Region size is 137438953472 bytes" name="" value="0x1c" />
         <value caption="Region size is 68719476736 bytes" name="" value="0x1b" />
         <value caption="Region size is 34359738368 bytes" name="" value="0x1a" />
         <value caption="Region size is 17179869184 bytes" name="" value="0x19" />
         <value caption="Region size is 8589934592 bytes" name="" value="0x18" />
         <value caption="Region size is 4294967296 bytes" name="" value="0x17" />
         <value caption="Region size is 2147483648 bytes" name="" value="0x16" />
         <value caption="Region size is 1073741824 bytes" name="" value="0x15" />
         <value caption="Region size is 536870912 bytes" name="" value="0x14" />
         <value caption="Region size is 268435456 bytes" name="" value="0x13" />
         <value caption="Region size is 134217728 bytes" name="" value="0x12" />
         <value caption="Region size is 67108864 bytes" name="" value="0x11" />
         <value caption="Region size is 33554432 bytes" name="" value="0x10" />
         <value caption="Region size is 16777216 bytes" name="" value="0xf" />
         <value caption="Region size is 8388608 bytes" name="" value="0xe" />
         <value caption="Region size is 4194304 bytes" name="" value="0xd" />
         <value caption="Region size is 2097152 bytes" name="" value="0xc" />
         <value caption="Region size is 1048576 bytes" name="" value="0xb" />
         <value caption="Region size is 524288 bytes" name="" value="0xa" />
         <value caption="Region size is 262144 bytes" name="" value="0x9" />
         <value caption="Region size is 131072 bytes" name="" value="0x8" />
         <value caption="Region size is 65536 bytes" name="" value="0x7" />
         <value caption="Region size is 32768 bytes" name="" value="0x6" />
         <value caption="Region size is 16384 bytes" name="" value="0x5" />
         <value caption="Region size is 8192 bytes" name="" value="0x4" />
         <value caption="Region size is 4096 bytes" name="" value="0x3" />
         <value caption="Region size is 2048 bytes" name="" value="0x2" />
         <value caption="Region size is 1024 bytes" name="" value="0x1" />
         <value caption="Region is not present" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT0REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT0REG1__SIZE">
         <value caption="Region size is 549755813888 bytes" name="" value="0x1e" />
         <value caption="Region size is 274877906944 bytes" name="" value="0x1d" />
         <value caption="Region size is 137438953472 bytes" name="" value="0x1c" />
         <value caption="Region size is 68719476736 bytes" name="" value="0x1b" />
         <value caption="Region size is 34359738368 bytes" name="" value="0x1a" />
         <value caption="Region size is 17179869184 bytes" name="" value="0x19" />
         <value caption="Region size is 8589934592 bytes" name="" value="0x18" />
         <value caption="Region size is 4294967296 bytes" name="" value="0x17" />
         <value caption="Region size is 2147483648 bytes" name="" value="0x16" />
         <value caption="Region size is 1073741824 bytes" name="" value="0x15" />
         <value caption="Region size is 536870912 bytes" name="" value="0x14" />
         <value caption="Region size is 268435456 bytes" name="" value="0x13" />
         <value caption="Region size is 134217728 bytes" name="" value="0x12" />
         <value caption="Region size is 67108864 bytes" name="" value="0x11" />
         <value caption="Region size is 33554432 bytes" name="" value="0x10" />
         <value caption="Region size is 16777216 bytes" name="" value="0xf" />
         <value caption="Region size is 8388608 bytes" name="" value="0xe" />
         <value caption="Region size is 4194304 bytes" name="" value="0xd" />
         <value caption="Region size is 2097152 bytes" name="" value="0xc" />
         <value caption="Region size is 1048576 bytes" name="" value="0xb" />
         <value caption="Region size is 524288 bytes" name="" value="0xa" />
         <value caption="Region size is 262144 bytes" name="" value="0x9" />
         <value caption="Region size is 131072 bytes" name="" value="0x8" />
         <value caption="Region size is 65536 bytes" name="" value="0x7" />
         <value caption="Region size is 32768 bytes" name="" value="0x6" />
         <value caption="Region size is 16384 bytes" name="" value="0x5" />
         <value caption="Region size is 8192 bytes" name="" value="0x4" />
         <value caption="Region size is 4096 bytes" name="" value="0x3" />
         <value caption="Region size is 2048 bytes" name="" value="0x2" />
         <value caption="Region size is 1024 bytes" name="" value="0x1" />
         <value caption="Region is not present" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT0REG1__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG0__SIZE">
         <value caption="Region size is 549755813888 bytes" name="" value="0x1e" />
         <value caption="Region size is 274877906944 bytes" name="" value="0x1d" />
         <value caption="Region size is 137438953472 bytes" name="" value="0x1c" />
         <value caption="Region size is 68719476736 bytes" name="" value="0x1b" />
         <value caption="Region size is 34359738368 bytes" name="" value="0x1a" />
         <value caption="Region size is 17179869184 bytes" name="" value="0x19" />
         <value caption="Region size is 8589934592 bytes" name="" value="0x18" />
         <value caption="Region size is 4294967296 bytes" name="" value="0x17" />
         <value caption="Region size is 2147483648 bytes" name="" value="0x16" />
         <value caption="Region size is 1073741824 bytes" name="" value="0x15" />
         <value caption="Region size is 536870912 bytes" name="" value="0x14" />
         <value caption="Region size is 268435456 bytes" name="" value="0x13" />
         <value caption="Region size is 134217728 bytes" name="" value="0x12" />
         <value caption="Region size is 67108864 bytes" name="" value="0x11" />
         <value caption="Region size is 33554432 bytes" name="" value="0x10" />
         <value caption="Region size is 16777216 bytes" name="" value="0xf" />
         <value caption="Region size is 8388608 bytes" name="" value="0xe" />
         <value caption="Region size is 4194304 bytes" name="" value="0xd" />
         <value caption="Region size is 2097152 bytes" name="" value="0xc" />
         <value caption="Region size is 1048576 bytes" name="" value="0xb" />
         <value caption="Region size is 524288 bytes" name="" value="0xa" />
         <value caption="Region size is 262144 bytes" name="" value="0x9" />
         <value caption="Region size is 131072 bytes" name="" value="0x8" />
         <value caption="Region size is 65536 bytes" name="" value="0x7" />
         <value caption="Region size is 32768 bytes" name="" value="0x6" />
         <value caption="Region size is 16384 bytes" name="" value="0x5" />
         <value caption="Region size is 8192 bytes" name="" value="0x4" />
         <value caption="Region size is 4096 bytes" name="" value="0x3" />
         <value caption="Region size is 2048 bytes" name="" value="0x2" />
         <value caption="Region size is 1024 bytes" name="" value="0x1" />
         <value caption="Region is not present" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG2__SIZE">
         <value caption="Region size is 549755813888 bytes" name="" value="0x1e" />
         <value caption="Region size is 274877906944 bytes" name="" value="0x1d" />
         <value caption="Region size is 137438953472 bytes" name="" value="0x1c" />
         <value caption="Region size is 68719476736 bytes" name="" value="0x1b" />
         <value caption="Region size is 34359738368 bytes" name="" value="0x1a" />
         <value caption="Region size is 17179869184 bytes" name="" value="0x19" />
         <value caption="Region size is 8589934592 bytes" name="" value="0x18" />
         <value caption="Region size is 4294967296 bytes" name="" value="0x17" />
         <value caption="Region size is 2147483648 bytes" name="" value="0x16" />
         <value caption="Region size is 1073741824 bytes" name="" value="0x15" />
         <value caption="Region size is 536870912 bytes" name="" value="0x14" />
         <value caption="Region size is 268435456 bytes" name="" value="0x13" />
         <value caption="Region size is 134217728 bytes" name="" value="0x12" />
         <value caption="Region size is 67108864 bytes" name="" value="0x11" />
         <value caption="Region size is 33554432 bytes" name="" value="0x10" />
         <value caption="Region size is 16777216 bytes" name="" value="0xf" />
         <value caption="Region size is 8388608 bytes" name="" value="0xe" />
         <value caption="Region size is 4194304 bytes" name="" value="0xd" />
         <value caption="Region size is 2097152 bytes" name="" value="0xc" />
         <value caption="Region size is 1048576 bytes" name="" value="0xb" />
         <value caption="Region size is 524288 bytes" name="" value="0xa" />
         <value caption="Region size is 262144 bytes" name="" value="0x9" />
         <value caption="Region size is 131072 bytes" name="" value="0x8" />
         <value caption="Region size is 65536 bytes" name="" value="0x7" />
         <value caption="Region size is 32768 bytes" name="" value="0x6" />
         <value caption="Region size is 16384 bytes" name="" value="0x5" />
         <value caption="Region size is 8192 bytes" name="" value="0x4" />
         <value caption="Region size is 4096 bytes" name="" value="0x3" />
         <value caption="Region size is 2048 bytes" name="" value="0x2" />
         <value caption="Region size is 1024 bytes" name="" value="0x1" />
         <value caption="Region is not present" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG2__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG3__SIZE">
         <value caption="Region size is 549755813888 bytes" name="" value="0x1e" />
         <value caption="Region size is 274877906944 bytes" name="" value="0x1d" />
         <value caption="Region size is 137438953472 bytes" name="" value="0x1c" />
         <value caption="Region size is 68719476736 bytes" name="" value="0x1b" />
         <value caption="Region size is 34359738368 bytes" name="" value="0x1a" />
         <value caption="Region size is 17179869184 bytes" name="" value="0x19" />
         <value caption="Region size is 8589934592 bytes" name="" value="0x18" />
         <value caption="Region size is 4294967296 bytes" name="" value="0x17" />
         <value caption="Region size is 2147483648 bytes" name="" value="0x16" />
         <value caption="Region size is 1073741824 bytes" name="" value="0x15" />
         <value caption="Region size is 536870912 bytes" name="" value="0x14" />
         <value caption="Region size is 268435456 bytes" name="" value="0x13" />
         <value caption="Region size is 134217728 bytes" name="" value="0x12" />
         <value caption="Region size is 67108864 bytes" name="" value="0x11" />
         <value caption="Region size is 33554432 bytes" name="" value="0x10" />
         <value caption="Region size is 16777216 bytes" name="" value="0xf" />
         <value caption="Region size is 8388608 bytes" name="" value="0xe" />
         <value caption="Region size is 4194304 bytes" name="" value="0xd" />
         <value caption="Region size is 2097152 bytes" name="" value="0xc" />
         <value caption="Region size is 1048576 bytes" name="" value="0xb" />
         <value caption="Region size is 524288 bytes" name="" value="0xa" />
         <value caption="Region size is 262144 bytes" name="" value="0x9" />
         <value caption="Region size is 131072 bytes" name="" value="0x8" />
         <value caption="Region size is 65536 bytes" name="" value="0x7" />
         <value caption="Region size is 32768 bytes" name="" value="0x6" />
         <value caption="Region size is 16384 bytes" name="" value="0x5" />
         <value caption="Region size is 8192 bytes" name="" value="0x4" />
         <value caption="Region size is 4096 bytes" name="" value="0x3" />
         <value caption="Region size is 2048 bytes" name="" value="0x2" />
         <value caption="Region size is 1024 bytes" name="" value="0x1" />
         <value caption="Region is not present" name="" value="0x0" />
      </value-group>
